In [55]:
import pandas as pd
df = pd.read_csv('./titanic/train.csv')

#### 获取其中多列，传入列表

In [56]:
df[['Age','Fare']][:5]

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

####  iloc 用position定位

In [72]:
df.iloc[0:5,1:3]

                                                    Survived  Pclass
Name
Braund, Mr. Owen Harris                                    0       3
Cumings, Mrs. John Bradley (Florence Briggs Tha...         1       1
Heikkinen, Miss. Laina                                     1       3
Futrelle, Mrs. Jacques Heath (Lily May Peel)               1       1
Allen, Mr. William Henry                                   0       3

In [58]:
df = df.set_index('Name')

#### iloc用lable定位

In [59]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [73]:
df.loc['Heikkinen, Miss. Laina']

PassengerId                   3
Survived                      1
Pclass                        3
Sex                      female
Age                        26.0
SibSp                         0
Parch                         0
Ticket         STON/O2. 3101282
Fare                      7.925
Cabin                       NaN
Embarked                      S
Name: Heikkinen, Miss. Laina, dtype: object

In [75]:
df.loc['Heikkinen, Miss. Laina','Fare']

7.925

In [81]:
df.loc['Heikkinen, Miss. Laina':'Allen, Mr. William Henry',:]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.100,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.050,NaN,S

In [83]:
df.loc['Heikkinen, Miss. Laina','Fare']=10
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,10.0000,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

#### 用bool类型索引

In [68]:
df[df['Age'] > 40]['Age']

Name
McCarthy, Mr. Timothy J                                54.0
Bonnell, Miss. Elizabeth                               58.0
Hewlett, Mrs. (Mary D Kingcome)                        55.0
Wheadon, Mr. Edward H                                  66.0
Holverson, Mr. Alexander Oskar                         42.0
                                                       ...
Swift, Mrs. Frederick Joel (Margaret Welles Barron)    48.0
Bystrom, Mrs. (Karolina)                               42.0
Beckwith, Mrs. Richard Leonard (Sallie Monypeny)       47.0
Vander Cruyssen, Mr. Victor                            47.0
Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)          56.0
Name: Age, Length: 150, dtype: float64

In [89]:
a = df['Sex'] == 'male'

In [95]:
df.loc[a,'Age'].mean()

30.72664459161148

In [96]:
(df['Age'] > 70).sum()

5